In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sample2.csv')

In [3]:
df.head()

   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0         1       A     CS     56.0       57.0   58.0      59.0  01-01-2001
1         2       A    ECE     23.0       24.0   25.0      26.0  02-01-2001
2         3       B   MECH     89.0       25.0   26.0      27.0  03-01-2001
3         4       C   MECH     45.0       26.0   27.0      28.0  04-01-2001
4         5       A     CS     23.0       27.0   28.0      29.0  05-01-2001

In [6]:
pivot_table = pd.pivot_table(df, index='Branch', values=['Physics', 'Chemistry', 'Maths', 'Computer'], aggfunc='mean')

In [7]:
print(pivot_table)

        Chemistry   Computer   Maths    Physics
Branch
CS      30.888889  37.200000  30.200  51.090909
ECE     32.857143  35.875000  32.750  53.000000
MECH    42.625000  44.222222  42.875  53.000000

In [8]:
pd.pivot_table(df, index='Branch', values=['Physics', 'Chemistry', 'Maths', 'Computer'], aggfunc='sum')

        Chemistry  Computer  Maths  Physics
Branch
CS          278.0     372.0  302.0    562.0
ECE         230.0     287.0  262.0    265.0
MECH        341.0     398.0  343.0    477.0

In [9]:
pd.pivot_table(df, index='Branch', values=['Physics', 'Chemistry', 'Maths', 'Computer'], aggfunc='count')

        Chemistry  Computer  Maths  Physics
Branch
CS              9        10     10       11
ECE             7         8      8        5
MECH            8         9      8        9